tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_PCI_TYPE0.h
#define ENETC_PCI_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK (0xFFFFFF00U)
#define ENETC_PCI_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT (8U)
#define ENETC_PCI_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK)
/*! @} */

/*! @name PCI_CFH_CL_SIZE - PCI cache line size register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK (0xFFU)
#define ENETC_PCI_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE(x) (((uint8_t)(((uint8_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK)
/*! @} */

/*! @name PCI_CFH_HDR_TYPE - PCI header type register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK (0x7FU)
#define ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE(x) (((uint8_t)(((uint8_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK (0x80U)
#define ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT (7U)
#define ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV(x) (((uint8_t)(((uint8_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK)
/*! @} */

/*! @name PCI_CFH_BAR0 - PCI base address register 0 */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_MASK (0x1U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_TYPE_MASK (0x6U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_TYPE_SHIFT (1U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_TYPE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR0_MEM_TYPE_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_PF_MEM_MASK (0x8U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_PF_MEM_SHIFT (3U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_PF_MEM(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR0_PF_MEM_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR0_PF_MEM_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_ADDR_MASK   (0xFFFFFFF0U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_ADDR_SHIFT  (4U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR0_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR0_ADDR_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR0_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR1 - PCI base address register 1 */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_MASK (0x1U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_TYPE_MASK (0x6U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_TYPE_SHIFT (1U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_TYPE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR1_MEM_TYPE_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM_MASK (0x8U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM_SHIFT (3U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_ADDR_MASK   (0xFFFFFFF0U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_ADDR_SHIFT  (4U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR1_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR1_ADDR_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR1_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR2 - PCI base address register 2 */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_MASK (0x1U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE_MASK (0x6U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE_SHIFT (1U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM_MASK (0x8U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM_SHIFT (3U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_ADDR_MASK   (0xFFFFFFF0U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_ADDR_SHIFT  (4U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR2_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR2_ADDR_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR2_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR3 - PCI base address register 3 */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_MASK (0x1U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE_MASK (0x6U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE_SHIFT (1U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE_MASK)

#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM_MASK (0x8U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM_SHIFT (3U)
#define ENETC_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM_MASK)

