tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_PCI_TYPE0.h
/*! @name PCIE_CFC_SRIOV_CAP_HDR - PCIe SR-IOV capability header */
/*! @{ */

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_MASK (0xFFFFU)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_MASK (0xF0000U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_SHIFT (16U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_MASK (0xFFF00000U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_SHIFT (20U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_CAP - PCIe SR-IOV capability register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_MASK (0x1U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_MASK (0x2U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_SHIFT (1U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_MASK (0xFFE00000U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_SHIFT (21U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_CTL - PCIe SR-IOV control register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_MASK (0x1U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_MASK (0x2U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_SHIFT (1U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_MASK (0x4U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_SHIFT (2U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_MASK (0x8U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_SHIFT (3U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_MASK (0x10U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_SHIFT (4U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_MASK (0x400U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_SHIFT (10U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_MASK)

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_MASK (0xF800U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_SHIFT (11U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_STAT - PCIe SR-IOV status register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_MASK (0x1U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_INIT_VFS - PCIe SR-IOV initial VFs register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_MASK (0xFFFFU)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_TOTAL_VFS - PCIe SR-IOV total VFs register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_MASK (0xFFFFU)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_SHIFT)) & ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_MASK)
/*! @} */

